zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_mdf.c
    *** Out-off limit detection ***
    ===============================
    [..]
      (#) Only for MDF instance, start out-off limit detection using HAL_MDF_OldStart()
          or HAL_MDF_OldStart_IT().
      (#) In polling mode, use HAL_MDF_PollForOld() to detect out-off limit and to get threshold
          information.
      (#) In interrupt mode, HAL_MDF_OldCallback() will be called if out-off limit detection occurs.
      (#) Stop out-off limit detection using HAL_MDF_OldStop() or HAL_MDF_OldStop_IT().

    *** generic functions ***
    =========================
    [..]
      (#) HAL_MDF_IRQHandler will be called when MDF or ADF interrupt occurs.
      (#) HAL_MDF_ErrorCallback will be called when MDF or ADF error occurs.
      (#) Use HAL_MDF_GetState() to get the current MDF or ADF instance state.
      (#) Use HAL_MDF_GetErrorCode() to get the current MDF or ADF instance error code.

    *** Callback registration ***
    =============================
    [..]
    The compilation define USE_HAL_MDF_REGISTER_CALLBACKS when set to 1
    allows the user to configure dynamically the driver callbacks.
    Use functions HAL_MDF_RegisterCallback(), HAL_MDF_RegisterOldCallback()
    or HAL_MDF_RegisterSndLvlCallback() to register a user callback.

    [..]
    Function HAL_MDF_RegisterCallback() allows to register following callbacks :
      (+) AcqCpltCallback     : Acquisition complete callback.
      (+) AcqHalfCpltCallback : Acquisition half complete callback.
      (+) SadCallback         : Sound activity detection callback (only for ADF instance).
      (+) ErrorCallback       : Error callback.
      (+) MspInitCallback     : MSP init callback.
      (+) MspDeInitCallback   : MSP de-init callback.
    [..]
    This function takes as parameters the HAL peripheral handle, the Callback ID
    and a pointer to the user callback function.

    [..]
    For MDF instance and for specific out-off limit detection callback use dedicated
    register callback :
    HAL_MDF_RegisterOldCallback().

    [..]
    For ADF instance and for specific sound level callback use dedicated register callback :
    HAL_MDF_RegisterSndLvlCallback().

    [..]
    Use function HAL_MDF_UnRegisterCallback() to reset a callback to the default weak function.

    [..]
    HAL_MDF_UnRegisterCallback() takes as parameters the HAL peripheral handle and the Callback ID.
    [..]
    This function allows to reset following callbacks :
      (+) AcqCpltCallback     : Acquisition complete callback.
      (+) AcqHalfCpltCallback : Acquisition half complete callback.
      (+) SadCallback         : Sound activity detection callback (only for ADF instance).
      (+) ErrorCallback       : Error callback.
      (+) MspInitCallback     : MSP init callback.
      (+) MspDeInitCallback   : MSP de-init callback.

    [..]
    For MDF instance and for specific out-off limit detection callback use dedicated
    unregister callback :
    HAL_MDF_UnRegisterOldCallback().

    [..]
    For ADF instance and for specific sound level callback use dedicated unregister callback :
    HAL_MDF_UnRegisterSndLvlCallback().

    [..]
    By default, after the call of init function and if the state is RESET
    all callbacks are reset to the corresponding legacy weak functions :
    examples HAL_MDF_AcqCpltCallback(), HAL_MDF_ErrorCallback().
    Exception done for MspInit and MspDeInit callbacks that are respectively
    reset to the legacy weak functions in the init and de-init only when these
    callbacks are null (not registered beforehand).
    If not, MspInit or MspDeInit are not null, the init and de-init keep and use
    the user MspInit/MspDeInit callbacks (registered beforehand).

    [..]
    Callbacks can be registered/unregistered in READY state only.
    Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
    in READY or RESET state, thus registered (user) MspInit/DeInit callbacks can be used
    during the init/de-init.
    In that case first register the MspInit/MspDeInit user callbacks using
    HAL_MDF_RegisterCallback() before calling init or de-init function.

    [..]
    When the compilation define USE_HAL_MDF_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registering feature is not available
    and weak callbacks are used.

    @endverbatim
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

#if defined(MDF1)

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */

/** @defgroup MDF MDF
  * @brief MDF HAL module driver
  * @{
  */

#ifdef HAL_MDF_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/** @defgroup MDF_Private_Typedefs  MDF Private Typedefs
  * @{
  */
/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/** @defgroup MDF_Private_Constants  MDF Private Constants
  * @{
  */
#define MDF_INSTANCE_NUMBER 7U /* 6 instances for MDF1 and 1 instance for ADF1 */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup MDF_Private_Variables  MDF Private Variables
  * @{
  */
static uint32_t           v_mdf1InstanceCounter = 0U;
static uint32_t           v_adf1InstanceCounter = 0U;
static MDF_HandleTypeDef *a_mdfHandle[MDF_INSTANCE_NUMBER] = {NULL};
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup MDF_Private_Functions  MDF Private Functions
  * @{
  */
static uint32_t MDF_GetHandleNumberFromInstance(const MDF_Filter_TypeDef *const pInstance);
static void     MDF_AcqStart(MDF_HandleTypeDef *const hmdf, const MDF_FilterConfigTypeDef *const pFilterConfig);
static void     MDF_DmaXferCpltCallback(DMA_HandleTypeDef *hdma);
static void     MDF_DmaXferHalfCpltCallback(DMA_HandleTypeDef *hdma);
static void     MDF_DmaErrorCallback(DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup MDF_Exported_Functions  MDF Exported Functions
  * @{
  */

/** @defgroup MDF_Exported_Functions_Group1  Initialization and de-initialization functions
  * @brief    Initialization and de-initialization functions
  *
@verbatim
  ==============================================================================
            ##### Initialization and de-initialization functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Initialize the MDF or ADF instance.
      (+) De-initialize the MDF or ADF instance.
      (+) Register and unregister callbacks.
@endverbatim
  * @{
  */

/**
  * @brief  Initialize the MDF instance according to the specified parameters
  *         in the MDF_InitTypeDef structure and initialize the associated handle.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_Init(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check MDF handle */
  if (hmdf == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_MDF_ALL_INSTANCE(hmdf->Instance));
    assert_param(IS_MDF_FILTER_BITSTREAM(hmdf->Init.FilterBistream));
    assert_param(IS_FUNCTIONAL_STATE(hmdf->Init.SerialInterface.Activation));

    /* Check that instance has not been already initialized */
    if (a_mdfHandle[MDF_GetHandleNumberFromInstance(hmdf->Instance)] != NULL)
    {
      status = HAL_ERROR;
    }
    else
    {
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
      /* Reset callback pointers to the weak predefined callbacks */
      if (IS_ADF_INSTANCE(hmdf->Instance))
      {
        hmdf->OldCallback   = NULL;
        hmdf->SndLvCallback = HAL_MDF_SndLvlCallback;
        hmdf->SadCallback   = HAL_MDF_SadCallback;
      }
      else /* MDF instance */
      {
        hmdf->OldCallback   = HAL_MDF_OldCallback;
        hmdf->SndLvCallback = NULL;
        hmdf->SadCallback   = NULL;
      }
      hmdf->AcqCpltCallback     = HAL_MDF_AcqCpltCallback;
      hmdf->AcqHalfCpltCallback = HAL_MDF_AcqHalfCpltCallback;
      hmdf->ErrorCallback       = HAL_MDF_ErrorCallback;

