zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_mdf.c
          /* Enable out-off limit detector */
          hmdf->Instance->OLDCR |= MDF_OLDCR_OLDEN;
        }
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop out-off limit detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_OldStop_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_INSTANCE(hmdf->Instance));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check out-off limit detector status */
    if ((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) != MDF_OLDCR_OLDACTIVE)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Disable out-off limit detection */
      hmdf->Instance->OLDCR &= ~(MDF_OLDCR_OLDEN);

      /* Disable out-off limit detector interrupt */
      hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_OLDIE);

      /* Clear potential pending out-off limit detection flags */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_OLDF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  MDF out-off limit detector callback.
  * @param  hmdf MDF handle.
  * @param  ThresholdInfo Threshold information of out-off limit detection.
  *         This parameter can be a value of @ref MDF_OldThresholdInfo.
  * @retval None.
  */
__weak void HAL_MDF_OldCallback(MDF_HandleTypeDef *hmdf, uint32_t ThresholdInfo)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);
  UNUSED(ThresholdInfo);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_OldCallback could be implemented in the user file */
}

/**
  * @}
  */

/** @defgroup MDF_Exported_Functions_Group6  Generic functions
  * @brief    Generic functions
  *
@verbatim
  ==============================================================================
                          ##### Generic functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Handle MDF interrupt.
      (+) Inform user that error occurs.
      (+) Get the current MDF instance state.
      (+) Get the current MDF instance error code.
@endverbatim
  * @{
  */

/**
  * @brief  This function handles the MDF interrupts.
  * @param  hmdf MDF handle.
  * @retval None.
  */
void HAL_MDF_IRQHandler(MDF_HandleTypeDef *hmdf)
{
  uint32_t tmp_reg1;
  uint32_t tmp_reg2;
  uint32_t interrupts;

  /* Read current flags and interrupts and determine which ones occur */
  tmp_reg1 = hmdf->Instance->DFLTIER;
  tmp_reg2 = hmdf->Instance->DFLTISR;
  interrupts = (tmp_reg1 & tmp_reg2);

  /* Check if data overflow occurs */
  if ((interrupts & MDF_DFLTISR_DOVRF) == MDF_DFLTISR_DOVRF)
  {
    /* Clear data overflow flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_DOVRF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_ACQUISITION_OVERFLOW;

    /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if snapshot overrun occurs */
  if ((interrupts & MDF_DFLTISR_SSOVRF) == MDF_DFLTISR_SSOVRF)
  {
    /* Clear snapshot overrun flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SSOVRF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_ACQUISITION_OVERFLOW;

    /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if RXFIFO threshold occurs */
  if ((interrupts & MDF_DFLTISR_FTHF) == MDF_DFLTISR_FTHF)
  {
    /* Call acquisition complete callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->AcqCpltCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_AcqCpltCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */

    /* Update state only in asynchronous single shot mode */
    if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_ACQMOD) == MDF_MODE_ASYNC_SINGLE)
    {
      hmdf->State = HAL_MDF_STATE_READY;
    }
  }
  /* Check if snapshot data ready occurs */
  if ((interrupts & MDF_DFLTISR_SSDRF) == MDF_DFLTISR_SSDRF)
  {
    /* Clear snapshot data ready flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SSDRF;

    /* Call acquisition complete callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->AcqCpltCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_AcqCpltCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if reshape filter overrun occurs */
  if ((interrupts & MDF_DFLTISR_RFOVRF) == MDF_DFLTISR_RFOVRF)
  {
    /* Clear reshape filter overrun flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_RFOVRF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_RSF_OVERRUN;

    /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if clock absence detection occurs */
  if ((interrupts & MDF_DFLTISR_CKABF) == MDF_DFLTISR_CKABF)
  {
    /* Clear clock absence detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_CLOCK_ABSENCE;

    /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if saturation occurs */
  if ((interrupts & MDF_DFLTISR_SATF) == MDF_DFLTISR_SATF)
  {
    /* Clear saturation flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SATF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_SATURATION;

    /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if short-circuit detection occurs */
  if ((interrupts & MDF_DFLTISR_SCDF) == MDF_DFLTISR_SCDF)
  {
    /* Clear short-circuit detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SCDF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_SHORT_CIRCUIT;

    /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if out-off limit detection occurs */
  if ((interrupts & MDF_DFLTISR_OLDF) == MDF_DFLTISR_OLDF)
  {
    uint32_t threshold_info;

    /* Get threshold information */
    if ((hmdf->Instance->DFLTISR & (MDF_DFLTISR_THLF | MDF_DFLTISR_THHF)) == 0U)
    {
      threshold_info = MDF_OLD_IN_THRESHOLDS;
    }
    else if ((hmdf->Instance->DFLTISR & MDF_DFLTISR_THLF) == MDF_DFLTISR_THLF)
    {
      threshold_info = MDF_OLD_LOW_THRESHOLD;
    }
    else
    {
      threshold_info = MDF_OLD_HIGH_THRESHOLD;
    }

